EDT/УТ/src/Catalogs/зпКатегорииЗаказов/зпКатегорииЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>зпКатегорииЗаказов</name>
  <owners>Catalog.зпСхемыКатегорийЗаказов</owners>
  <attributes>
    <name>УровеньОбслуживания</name>
    <type>
      <types>EnumRef.УровниОбслуживания</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияДоставкиДляАналитики</name>
    <type>
      <types>EnumRef.зпКлассификаторКатегорийДоставки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоказателиКатегории</name>
    <attributes>
      <name>ВидПоказателя</name>
      <type>
        <types>EnumRef.зпВидыПоказателейКатегорийЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение1</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение2</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/зпКатегорииЗаказов/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		Если Не РольДоступна("Админы") Тогда
			ТолькоПросмотр = Истина;
			//Элементы.ГрФорма.
		КонецеСли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Сообщить("Внимание!!! Ошибка записи, введите наименование!");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для Каждого СтрокаПоказателя Из Объект.ПоказателиКатегории Цикл
		ТипЗначения1 = ТипЗнч(СтрокаПоказателя.Значение1);
		ТипЗначения2 = ТипЗнч(СтрокаПоказателя.Значение2);
		Если ТипЗначения1 <> ТипЗначения2 Тогда
			Отказ = Истина;
			Сообщить("Типы значений в строке " + СтрокаПоказателя.НомерСтроки +  " не совпадают: Значение1 - " + ТипЗначения1 + ", Значение2 - " + ТипЗначения2);
		КонецЕсли
	КонецЦикла;
	
КонецПроцедуры
